{"/curriculo":{"title":"Currículo do Curso de Engenharia de Computação","data":{"":"Currículo do curso de Engenharia de Computação. Nele, você encontrará todas as informações necessárias para navegar através do seu curso. O currículo completo pode ser acessado em enc.ufsc.br/curriculo/.\nDisciplinas obrigatórias (3456 Horas Aula - H/A, 2880 Horas): Estas disciplinas são essenciais para o seu aprendizado e aprimoramento no campo da Engenharia de Computação. Elas oferecem uma base sólida em conceitos teóricos e práticos. Algumas disciplinas obrigatórias podem incluir programação, cálculo, física, eletrônica, entre outras.\nDisciplinas Optativas (72 H/A, 60 Horas): Estas disciplinas permitem que você personalize seu currículo de acordo com seus interesses. Elas podem abranger uma variedade de tópicos, desde inteligência artificial até desenvolvimento web.\nEstágio Obrigatório (216 H/A, 180 Horas): O estágio obrigatório oferece a oportunidade de aplicar o que você aprendeu em um ambiente de trabalho real. É uma ótima maneira de ganhar experiência prática e fazer contatos no setor. Consulte a seção \"Estágio Obrigatório\" abaixo para obter mais detalhes.\nAtividades Complementares (144 H/A, 120 Horas): Estas atividades extras permitem ampliar sua formação e experiências. Elas podem incluir a publicação de artigos, participação em congressos e eventos, cursos de línguas estrangeiras, atividades esportivas, entre outros.\nAtividades Acadêmicas de Extensão (432 H/A, 360 Horas): Estas atividades proporcionam a oportunidade de compartilhar o conhecimento adquirido com a comunidade externa. Elas podem incluir projetos, oficinas, cursos, programas, entre outros.\nEstágio Obrigatório\nAqui estão algumas informações mais detalhadas sobre o estágio obrigatório:\nDuração: Você pode fazer até 2 anos de estágio na mesma empresa.\nCarga horária: Poderá ser de 30 horas para alunos que estão matriculados em outras disciplinas ou 40 horas para alunos que não estão matriculados em disciplinas presenciais (exceto TCC).\nRemuneração: Os estágios obrigatórios podem, ou não, ser remunerados.\nSeguro: De acordo com a Lei de Estágios (11.788/2008), todo estagiário deve possuir um seguro contra acidentes pessoais.\nSupervisor: Você precisará de um supervisor para o estágio.\nOrientador: Você precisará de um professor orientador da UFSC para o estágio.\n\n\n\nTodo o processo deve ser registrado no SIARE, o sistema da UFSC de estágios.","primeiras-matérias#Primeiras Matérias":"As primeiras matérias do curso de Engenharia de Computação da UFSC Araranguá são obrigatórias e são necessárias para o resto do curso. Essas matérias introduzem os conceitos básicos de programação, computação, circuitos digitais, matemática e geometria analítica.","linguagem-de-programação-i---dec0012#Linguagem de Programação I - DEC0012":"Esta disciplina introduz o conceito de linguagem de programação. Os alunos aprendem sobre a estrutura de uma linguagem de programação, sintaxe, semântica e compilação. linguagem de programação geralmente usada é C","introdução-à-engenharia-de-computação---dec7070#Introdução à Engenharia de Computação - DEC7070":"Esta disciplina fornece uma visão geral da engenharia de computação. Os alunos aprendem sobre a história da computação, os fundamentos da computação, os diferentes tipos de sistemas de computação e as diferentes áreas de aplicação da computação. Eles também aprendem sobre os diferentes tipos de profissionais de computação, como engenheiros de software, arquitetos de sistemas e analistas de sistemas.","circuitos-digitais---dec7546#Circuitos Digitais - DEC7546":"Esta disciplina introduz os conceitos básicos de circuitos digitais. Os alunos aprendem sobre sistemas numéricos, álgebra booleana, portas lógicas, circuitos combinacionais, circuitos sequenciais e simulação de circuitos. Eles também aprendem sobre os diferentes tipos de circuitos digitais, como circuitos aritméticos, circuitos de controle e circuitos de memória.","pré-cálculo---fqm7001#Pré-Cálculo - FQM7001":"Esta disciplina fornece uma base matemática para o estudo da engenharia de computação. Os alunos aprendem sobre conjuntos e aritmética básica, cálculo com expressões algébricas, equações, inequações e funções. Eles também aprendem sobre os diferentes tipos de funções, como funções polinomiais, funções exponenciais e funções logarítmicas.","geometria-analítica---fqm7103#Geometria Analítica - FQM7103":"Esta disciplina introduz os conceitos básicos de geometria analítica. Os alunos aprendem sobre retas, planos, cônicas e quádricas. Eles também aprendem sobre os diferentes tipos de curvas, como curvas algébricas, curvas logarítmicas e curvas paramétricas","validação-de-disciplinas#Validação de Disciplinas":"Se você já cursou disciplinas em outra Instituição de Ensino Superior (IES) e está buscando a validação dessas disciplinas na UFSC, veja a seguir as etapas do processo no link DAE Validação de Disciplinas","segunda-chamada-de-avaliações#Segunda Chamada de Avaliações":"Compreendemos que, às vezes, circunstâncias inesperadas podem impedir os estudantes de realizar uma avaliação na data marcada. Se você não puder participar de uma avaliação por uma razão válida, poderá solicitar uma segunda chamada.Para solicitar a segunda chamada de uma avaliação, você precisará preencher um formulário de solicitação de segunda chamada,e enviar dentro do prazo de três dias úteis após a data original da avaliação. O formulário deve ser acompanhado por documentos comprobatórios, como um atestado médico, caso a ausência tenha sido devido a problemas de saúde."}},"/highlights":{"title":"Resumo","data":{"":"Matrículas e sistemas de ensino o primeiro passo para consultar o calendário acadêmico. Também há informações sobre como as aulas são executadas, incluindo tempo, disciplina, código da classe e código da sala. Você também pode saber mais sobre as atividades extracurriculares que a UFSC oferece aos alunos. Atletismo, pesquisa científica e laboratórios de pesquisa são ótimas maneiras de os alunos avançarem em sua educação. Há também muitos estágios e oportunidades de trabalho disponíveis. Se a sua ausência for por motivos de saúde, deverá apresentar um pedido por escrito no prazo de três dias a contar da data da primeira revisão. Se um aluno receber uma nota de reprovação, ele ou ela não poderá participar da bolsa de estudos ou do programa de intercâmbio da universidade.","destaques-essenciais#Destaques Essenciais":"1.1. Sistemas de matrícula e aprendizagem o sistema CAGR é utilizado para matrícula e a plataforma Moodle para apoio pedagógico.1.2. Calendário acadêmico fornece prazos críticos para inscrições em cursos, datas de exames, períodos de férias, etc mais informações visite https://dae.ufsc.br/calendario-academico-de-graduacao/.1.3 O Currículo do Curso de Engenharia de Computação as primeiras disciplinas, incluindo Linguagem de Programação I, Introdução à Engenharia da Computação, Circuitos Digitais, Pré-Cálculo e Geometria Analítica, fornecem uma compreensão fundamental e são necessárias para o restante currículo do curso .1.4. SIG responsável pelas funções administrativas e acadêmicas dos cursos de graduação do Centro de Ciência, Tecnologia e Saúde, visite site SIG Araranguá UFSC.1.5. Biblioteca universitária aqui você pode pegar livros emprestados, usar computadores e espaços de estudo visite pagina  Portal BU.1.6. PRAE oferece programas e serviços básicos para estudantes, incluindo assistência estudantil, psicologia educacional e restaurante universitário.1.7. Custo de vida em Araranguá o custo de vida em Araranguá é relativamente baixo, visite pagina Custo de vida1.8. Projetos esportivos através da Atlética Campus Araranguá Facebook da AAACA UFSC.1.9. Iniciação científica oferece uma grande oportunidade de se envolver em projetos de pesquisa e ampliar seus conhecimentos, visite o site do PIBIC.1.10. Laboratórios de pesquisa são componentes fundamentais da engenharia da computação da UFSC verifique o site laboratorios-ararangua.1.11. Oportunidades de estágio e emprego verifique regularmente o site do DIP para obter essas oportunidades.1.12. CAE promove acessibilidade educacional para pessoas com deficiência.1.13. Ouvidoria é um canal para manifestação de dúvidas, críticas, sugestões e elogios.2.1. Estágio obrigatório é parte integrante do curso. O programa de estágio permite que você aplique o conhecimento adquirido durante o curso em situações do mundo real. Certifique-se de que todo o processo esteja registrado no SIARE, sistema de estágio da UFSC.2.2. Validação de disciplinas alunos que já estudaram em outra Instituição de Ensino Superior podem ter a opção de validar seus cursos na UFSC. O processo pode ser consultado no link DAE Validação de Disciplinas3.1 O Programa Institucional de Apoio Pedagógico ao Estudante PIAPE da UFSC oferece suporte ao aluno no atendimento de suas necessidades específicas de aprendizagem.3.2 A saúde mental é fundamental, e a UFSC oferece um serviço de apoio psicológico, o SAPSI. Os alunos que se sentem sobrecarregados ou estressados são encorajados a procurar ajuda.4.1 Existem oportunidades de monitoramento pagas e voluntárias para os alunos ajudarem outras pessoas que possam estar enfrentando dificuldades de aprendizado Secretaria Integrada de Departamentos.4.2 Para concorrer ao cargo de monitoria remunerada, o aluno deverá ter nota mínima de 7,0 na respectiva disciplina e se inscrever por meio da Secretaria dos Departamentos Integrados.Por favor, explore os links fornecidos para obter informações detalhadas. Lembre-se de que você pode entrar em contato para qualquer dúvida. Bem-vindo à UFSC!"}},"/":{"title":"Manual para Calouro - Engenharia de Computação, Centro Acadêmico da UFSC Araranguá","data":{"":"Parabéns por ser aceito na Universidade Federal de Santa Catarina (UFSC)! A seguir, forneceremos informações importantes para os novos alunos do curso de Engenharia de Computação","matrícula-e-sistemas-de-aprendizado#Matrícula e Sistemas de Aprendizado":"","cagr#CAGR":"As matrículas são realizadas através do sistema CAGR - Controle Acadêmico da Graduação. Para dúvidas e esclarecimentos sobre o processo de matrícula, envie um email para sig.cts.ara@contato.ufsc.br com o assunto \"[Matrícula de Calouro] + Seu Nome Completo\".","moodle#Moodle":"Além disso, a UFSC utiliza a plataforma Moodle como apoio ao ensino. Professores podem postar materiais de aula, atividades, e promover fóruns de discussão. Acesse o Moodle com seu IDUFSC e senha do CAGR","calendário-acadêmico#Calendário acadêmico":"O primeiro passo é verificar o calendário acadêmico da UFSC. Isso fornecerá informações sobre quando as aulas começam, bem como quaisquer prazos importantes, como a última data para o registro de disciplinas, datas de exames, períodos de férias e assim por diante.No site do DAE, você tem acesso ao calendário acadêmico da UFSC: https://dae.ufsc.br/calendario-academico-de-graduacao/","centro-de-ciências-tecnologia-e-saúde-cts#Centro de Ciências, Tecnologia e Saúde (CTS)":"O CTS coordena as atividades de ensino, pesquisa e extensão nas áreas de Ciências, Tecnologia e Saúde na UFSC. O CTS é composto por diferentes coordenadorias e departamentos, incluindo:","coordenadoria-especial-de-física-química-e-matemática-fqm#Coordenadoria Especial de Física, Química e Matemática (FQM)":"Este departamento oferece disciplinas nas áreas de Física, Química e Matemática.","coordenadoria-especial-interdisciplinar-em-tecnologias-da-informação-e-comunicação-cit#Coordenadoria Especial Interdisciplinar em Tecnologias da Informação e Comunicação (CIT)":"Este departamento oferece disciplinas relacionadas à educação, academia e tecnologia da informação.","departamento-de-computação-dec#Departamento de Computação (DEC)":"Este departamento oferece disciplinas relacionadas à área de computação.","horário-de-aulas#Horário de Aulas":"As aulas na UFSC têm duração de 50 minutos cada, equivalendo a uma (1) hora-aula (H/A). As aulas são realizadas de segunda a sexta-feira, de acordo com os seguintes horários:\nManhã: 07h30 às 11h50\nTarde: 13h30 às 18h00\nNoite: 18h30 às 22h00\n\nNo sábado, as aulas ocorrem apenas no período da manhã.Para acessar seus horários de aula, faça login na área do aluno através do CAGR e clique em \"Grade de Horários\".","código-do-horário#Código do horário":"O código do horário é formatado como \"4.16:20-2\" ou \"6.07:30-3\". O primeiro dígito é referente ao dia da semana (2=segunda, 3=terça, e assim por diante). Os próximos quatro valores são referentes ao horário da aula e o último dígito indica a quantidade de aulas.","código-de-disciplina#Código de disciplina":"Códigos de disciplina seguem o formato de 3 letras e 4 dígitos. As letras indicam o departamento responsável pela disciplina, como DEC, DCS, EES, FQM, CIT. Por exemplo, FQM7101 se refere à disciplina de Cálculo I.","código-de-turma#Código de turma":"O código da turma é composto de 5 dígitos, sendo os dois primeiros referentes à fase e os 3 últimos ao curso, 652-TIC, 653-ENE, 654-FISIO, 655-ENC. Exemplo: 01655, turma 01 do curso 655 que é Engenharia de Computação.","código-de-sala#Código de sala":"Os códigos das salas são formatados com 2 letras e 3 números, seguidos da numeração do bloco. Por exemplo, SL303A se refere à sala 3 do 3º andar do bloco A.","currículo-do-curso#Currículo do Curso":"Click aqui para ler mais.","sig---secretaria-integrada-de-graduação#SIG - Secretaria Integrada de Graduação":"A SIG é responsável por realizar funções administrativas e acadêmicas dos conselhos de cursos de graduação do Centro de Ciências, Tecnologias e Saúde do Campus Araranguá. Para mais informações, acesse o site da SIG Araranguá UFSCO Cartão de Acesso UFSC é essencial para acessar várias instalações na universidade, como a biblioteca e o restaurante universitário. Para adquiri-lo, dirija-se à SIG","biblioteca-universitária#Biblioteca Universitária":"A BU permite o empréstimo de livros, uso de computadores e espaços para estudo. O cartão de acesso UFSC é necessário para empréstimos. Para acessar a Biblioteca online tirar duvidas acesse link para mais informação Portal BU.","prea---pró-reitoria-de-permanência-e-assuntos-estudantis#PREA - Pró-Reitoria de Permanência e Assuntos Estudantis":"A PREA é responsável por uma variedade de programas e serviços fundamentais para os estudantes como:\nAssistência Estudantil\nMoradia\nPsicologia Educacional\nRestaurante Universitário\n\nPara mais informações sobre cada serviço e como acessá-los, visite o site da PRAE","conhecendo-o-campus#Conhecendo o campus":"O campus da UFSC em Araranguá tem duas unidades a que fica no bairro Jardim das Avenidas - CEP: 88.906-072, a cerca de 2 quilômetros do centro da cidade de Araranguá é onde são a maioria das aulas e também é onde fica a Biblioteca. A outra unidade fica no bairro Mato Alto - CEP: 88.905-120 onde fica alguns dos laboratóriosO Campus Araranguá é uma área arborizada e bem cuidada, o que o torna um ambiente agradável para estudar e trabalhar.","mapa#Mapa":"","custo-de-vida-em-araranguá#Custo de vida em Araranguá":"Se você estiver se mudando para Santa Catarina, organize sua acomodação com antecedência. Além disso, verifique as rotas de transporte para o campus da universidade.\nAluguel: O custo do aluguel em Araranguá varia de R$ 370,00 a R$ 1.286,67, dependendo da localização e do tamanho do imóvel.\nAlimentação: O custo da alimentação em Araranguá também varia, mas geralmente é mais barato do que em outras cidades do Brasil. Um almoço em um restaurante barato custa cerca de R$ 11,98, enquanto um almoço em um restaurante caro custa cerca de R$ 31,39. Para se alimentar no RU o valor da refeição é de R$1,50 para estudantes de graduação para adicionar créditos ao seu cartão vá no site RU Araranguá.\nTransporte: O custo do transporte em Araranguá também é relativamente baixo. Uma passagem de ônibus custa R$ 3,40, e uma corrida de táxi custa cerca de R$ 10,00 por quilômetro.\n\nNo geral, o custo de vida em Araranguá é relativamente baixo, tornando-a uma cidade acessível para estudantes de graduação em Engenharia de Computação. Para mais informações sobre outros custos acesse link www.custodevida.com.br/sc/ararangua/","monitoria-e-atividades-extracurriculares#Monitoria e Atividades Extracurriculares":"Você pode obter informações sobre a monitoria através do sistema Moni. Lá você encontrará informações sobre quais disciplinas possuem monitores, os horários e locais de atendimento, e o plano de atividades. Editais e cronogramas emitidos pela Coordenação Acadêmica são publicados ao longo do ano letivo no site da Secretaria Integrada de Departamentos. Click aqui para ler mais.","projetos-esportivos#Projetos Esportivos":"Como estudante da UFSC, você é encorajado a participar de atividades esportivas através da Atlética Campus Araranguá - AAACA UFSC. Essa experiência não só promove a saúde física, mas também a habilidade de trabalhar em equipe e a liderança. Acompanhe os eventos e atividades no Facebook da AAACA UFSC.","iniciação-científica#Iniciação Científica":"A Iniciação Científica é uma grande oportunidade para você se envolver em projetos de pesquisa e ampliar seus conhecimentos teóricos e práticos. A UFSC oferece bolsas por meio do Programa Institucional de Bolsas de Iniciação Científica (PIBIC). Para mais informações, visite o site do PIBIC.","laboratórios-de-pesquisa#Laboratórios de Pesquisa":"A pesquisa é uma componente fundamental na engenharia de computação. Na UFSC, temos uma variedade de laboratórios de pesquisa disponíveis para os alunos. Para uma lista completa, visite laboratorios-ararangua.","atividades-complementares#Atividades Complementares":"Para além da sala de aula, as Atividades Complementares são obrigatórias e reforçam sua formação social e profissional. Elas podem incluir workshops, seminários, competições de programação e muito mais. Se você precisar de mais informações, envie um e-mail para sig.cts.ara@contato.ufsc.br.","oportunidades-de-estágio-e-emprego#Oportunidades de Estágio e Emprego":"A UFSC regularmente posta oportunidades de estágio e emprego no site da universidade, através do DIP. É fundamental verificar regularmente essas postagens para não perder nenhuma oportunidade.","caec---centro-acadêmico-de-engenharia-de-computação#CAEC - Centro Acadêmico de Engenharia de Computação":"O CAEC representa os estudantes de Engenharia de Computação da UFSC Araranguá. Para recebem os aviso entre no nosso grupo do WhatsApp. Para contato, envie e-mail para caecufsc@gmail.com ou mensagem via Instagram @caecufsc","cae---coordenadoria-de-acessibilidade-educacional#CAE - Coordenadoria de Acessibilidade Educacional":"CAE é um setor da UFSC que promove a acessibilidade educacional para as pessoas com deficiência. Saiba mais sobre os serviços do CAE","ouvidoria#Ouvidoria":"A Ouvidoria da UFSC é um canal para expressar dúvidas, críticas, sugestões e elogios. Veja como usar a Ouvidoria da UFSC Ouvidoria","grupos-no-whatsapp#Grupos no WhatsApp":"UFSC Aru Utilidades 🧰"}},"/indices":{"title":"Índice","data":{"":"","índice-de-aproveitamento-ia#Índice de Aproveitamento (IA)":"O Índice de Aproveitamento Semestral (IA) é calculado pela soma de todas as notas das disciplinas cursadas em um semestre, dividida pelo número de disciplinas. Este índice representa o desempenho do estudante em um semestre específico.Para se candidatar à monitoria de uma disciplina precisa ter IA acima da média da turma. Para pleitear uma bolsa de iniciação científica, onde há concorrência entre alunos do país todo, também será exigido bom (IA).","créditos#Créditos":"Os créditos são a unidade elementar de horas-aula de qualquer curso da UFSC. O número de créditos de uma disciplina indica a quantidade de horas semanais de aulas dessa disciplina. Para se formar no curso, é preciso completar um número específico de créditos.","índice-de-aproveitamento-acumulado-iaa#Índice de Aproveitamento Acumulado (IAA)":"O IAA é calculado cumulativamente a cada semestre, representando o somatório dos resultados das multiplicações das notas pelas cargas horárias das disciplinas cursadas, dividido pela carga horária total matriculada. A fórmula para o cálculo do IAA é:\nIAA = pontos obtidos / carga horária matriculada","índice-de-aproveitamento-probatório-iap#Índice de Aproveitamento Probatório (IAP)":"O IAP é calculado de forma semelhante ao IAA, mas considera apenas as disciplinas em que o estudante foi aprovado.","índice-de-matrícula-im#Índice de Matrícula (IM)":"O IM é calculado utilizando a seguinte fórmula:\nIM = IAA * CHC / CHT\n\nIAA é o Índice de Aproveitamento Acumulado,\nCHC é a Carga Horária Cursada,\nCHT é a Carga Horária Total prevista no currículo do curso para a respectiva habilitação.","capítulo-frequência-insuficiente-fi#Capítulo: Frequência Insuficiente (FI)":"A questão da frequência insuficiente (FI) é crucial para o sucesso de todos os estudantes da UFSC. De acordo com a Resolução nº 17/CUn/1997 (veja aqui), você é obrigado a comparecer a pelo menos 75% das aulas para cada disciplina. Falhar em atingir essa marca resultará na reprovação por frequência insuficiente (FI). Este capítulo explica mais detalhes sobre a FI e fornece links relevantes para obter informações adicionais.","o-que-é-a-fi#O que é a FI?":"A frequência insuficiente é quando um estudante tem uma frequência de menos de 75% em uma disciplina. O aluno que recebe uma FI será reprovado e não terá a opção de fazer a recuperação final (REC).","como-a-fi-é-calculada#Como a FI é calculada?":"Para calcular a FI, você deve considerar a carga horária total da disciplina. Por exemplo, em uma disciplina de 72 horas/aula, você só receberá uma FI se tiver mais de 18 faltas (mais de 25% das aulas). Portanto, ao atingir a 19ª falta, você será reprovado por frequência insuficiente.","implicações-da-fi#Implicações da FI":"Receber uma FI pode ter consequências graves. Isso pode levar à perda de participação em editais de bolsas, monitorias e intercâmbios. Portanto, é crucial garantir a manutenção da frequência.","o-papel-do-professor-e-do-aluno#O papel do professor e do aluno":"A responsabilidade de registrar a frequência é do professor, enquanto o aluno é responsável por acompanhar o registro da frequência com cada professor. É importante comunicar-se regularmente com seus professores para evitar qualquer mal-entendido sobre sua frequência.Lembre-se de que é de sua responsabilidade manter um bom desempenho acadêmico. Mantenha uma frequência adequada, estude de maneira regular e responsável, e comunique-se com seus professores sempre que tiver alguma dúvida ou preocupação. A UFSC tem uma variedade de recursos para ajudá-lo a ter sucesso.","pipe---programa-institucional-de--apoio-pedagógico-aos-estudantes#PIPE - Programa Institucional de  Apoio Pedagógico aos Estudantes":"O Programa Institucional de Apoio Pedagógico aos Estudantes PIAPE: um programa que visa atender as necessidades específicas de aprendizagem dos estudantes da UFSC, considerando seus aspectos epistêmicos, humanos e sociais.","saúde-e-bem-estar#Saúde e Bem-estar":"Sabemos que a vida universitária pode ser estressante. Por isso, a UFSC oferece um serviço de apoio psicológico, o SAPSI. Se sentir necessidade, não hesite em buscar ajuda."}},"/listas":{"title":"Listas","data":{"":"","telefones#Telefones":"Link para os telefones da UFSC telefones.ufsc.brDelegacia de Polícia\n(48) 3524-5182\nRua Sebastião José Lemos, 410 – Cidade AltaDelegacia de Proteção à criança, adolescente, mulher e idoso\n(48) 3529-0242\nRua Regimento Barriga Verde, 800 – CentroHospital Reginal de Araranguá\n(48) 3521-1500\nRua Castro Alves, 303 – ColoninhaPonto de Taxi\n(48) 3522-0460\nPc. Hercílio Luz – CentroTerminal Rodoviário de Araranguá\n(48) 3522-0238\nPc. Hercílio Luz, 612 – CentroCelesc (Energia)\n(48) 3524-0780\nRua Rui Barbosa, 47 – CentroCorreios\n(48) 3522-0586\nAv. Getúlio Vargas, 119 – CentroPrefeitura Municipal de Araranguá\n(48) 3524-1900\nRua Dr. Virgulino de Queiróz, 200 – Centro","software#Software":"Para acessar lista completa do https://otrs.setic.ufsc.br/otrs/public.pl\nArquivos: Serviço de compartilhamento de arquivos da UFSC - Muito útil para compartilhamento de documentos de trabalho em grupo ou projetos.\nAutenticação Centralizada (CAS): Autenticação Centralizada - Esse sistema provavelmente controla o acesso a muitos serviços online da universidade.\nComputadores: Fornece suporte para configuração, manutenção e especificação de computadores - Recurso crucial para estudantes de Engenharia de Computação.\nCódigos: Serviço de versionamento de códigos - Importante para projetos de programação e controle de versões.\nE-mail: Provê o serviço de correio eletrônico para a comunidade UFSC - Comunicação principal com professores e colegas de classe.\nFileSender@RNP: Serviços de envio de arquivos grandes - Útil para compartilhar grandes conjuntos de dados ou arquivos de projetos.\nGoogle G-Suite/Google WorkSpace: Conjunto de ferramentas de produtividade e colaboração online.\nMicrosoft: Ferramentas da Microsoft, como o Office 365.\nMATL: Sistema de Materiais - Potencialmente útil para projetos de hardware.\nMensagens instantâneas: Serviço de mensagens instantânea - Útil para comunicação rápida e eficiente com colegas de classe e professores.\nPortal Periódicos CAPES: Recurso valioso para pesquisas acadêmicas.\nVPN para redeUFSC: Ferramenta útil para acessar recursos da rede UFSC de fora do campus.","paginas#Paginas":"Os seguintes links podem ser de interesse:\nprofessores e horários de atendimento\nsistema de controle acadêmico de graduação CAGR\nsetor de ti\ninscrições abertas para o curso introdução ao pensamento computacional com programação em blocos visuais\nnoticias\neditais\ncurrículo\nplanos de ensino\nprojeto pedagógico do curso\nformulários para defesa\nextensão curricular\nprojeto integrador\ncoordenação de pesquisa e extensão\nrelação de disciplinas optativa\nacessibilidade\nmapa e endereços\nserviços para a comunidade\ncampi\ncentros de ensino e departamentos\nperguntas frequentes\nregulamento\nacesso a rede wireless\nemail\nsolicitar carteirinha ru\ndiretório central dos estudantes\nagenda de aulas magnas e aulas inaugurais\nemitir certificado digital pessoal icp edu\noportunidades\nabono de faltas\nlegislação\nmenção i\nmobilidade acadêmica\nresumo calendário acadêmico\ntrancamento de matricula\nrestaurante universitário\nbiblioteca\ncentros acadêmicos\nesportes"}},"/moni":{"title":"Monitoria","data":{"":"É um sistema de consulta sobre as monitorias do Centro. Algumas disciplinas têm estudantes monitores que auxiliam os que têm dificuldades de aprendizagem sendo um apoio aos estudos.Existe dois tipos de Monitoria:","remunerada#Remunerada":"O primeiro passo para o processo de seleção de monitorias realiza a inscrição no site da Secretaria Integrada de Departamentos\nREQUISITOS E INFORMAÇÕES IMPORTANTES\nO aluno deve ter obtido nota igual ou superior a 7,0 na disciplina.\nUm aluno que seja monitor bolsista em uma disciplina pode ser monitor voluntário em outra disciplina.\nO monitor voluntário possui as mesmas obrigações que o bolsista.\nEm todos os cursos, incluindo Engenharia de Computação, a monitoria pode ser validada como atividades complementares (verificar com o coordenador do curso o limite de horas).\nO aluno pode ser monitor em até 4 semestres ao longo do seu curso.","voluntária#Voluntária":"Candidatura pode ocorrer a qualquer tempo, dependendo do interesse do aluno e do professor da disciplina.","empreendedorismo-e-inovação#Empreendedorismo e inovação":"A UFSC incentiva o espírito empreendedor e possui iniciativas para apoiar alunos interessados em inovação e empreendedorismo. A Empresa Júnior de Engenharia de Computação formada e gerida por alunos de graduação da UFSC Araranguá. Você pode visitar o site para saber mais EJEC."}}}